# VerticalExtent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CameraInfo..::..VerticalExtent Property
CameraInfo Class See Also
---
Distance between top and bottom planes on the target plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double VerticalExtent { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VerticalExtent As Double
	Get
```

Visual C++
---
```text
public:
property double VerticalExtent {
	double get ();
}
```

# See Also
CameraInfo Class
Autodesk.Revit.DB Namespace